---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.IncludeShadingSurfaces
source: html/ceb9f732-a01f-7c34-21bf-431305bd1de8.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.IncludeShadingSurfaces Property

Indicates if to set and get the setting for if shading surfaces should be included.

## Syntax (C#)
```csharp
public bool IncludeShadingSurfaces { get; set; }
```

## Remarks
The default is to include the shading surfaces.